---
type: RebarContainerType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# RebarContainerType

`Autodesk.Revit.DB.Structure.RebarContainerType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefaultRebarContainerType | 2016 | `public static ElementId CreateDefaultRebarContainerType ( Document aDoc )` |
| Method | GetOrCreateRebarContainerType | 2016 | `public static ElementId GetOrCreateRebarContainerType ( Document aDoc , string name )` |
| Property | Parameter | — | `` |